org/doc/paf.org
#+STARTUP: showall indent hidestars

#+TITLE: Forth как переносимый ассемблер
#+AUTHOR: M. Anton Ertl, TU Wien

* Abstract

Переносимый ассемблер, как и обычный ассемблер предоставляет доступ к аппаратным
возможностям компьютера, таким как:
- адреса памяти
- машинные слова
- адреса кода
- арифметика по модулю
но абстрагирует различия между архитектурами, такими как:
- синтаксис ассемблера
- кодирование команд
- набор регистров и их размер
- режимы адресации.

Forth уже удовлетворяет ряду характеристик переносимого ассемблера и, следовательно,
является хорошей основой.

В этом документе представлен PAF, переносимый язык ассемблера основанный на
Forth. Специально обсуждаются функции языка, которые другие переносимые ассемблеры не
имеют и их преимущества; в нем также обсуждается отличия от Forth.

Главные инновации PAF это:
- теги, которые указывают поток управления для косвенного ветвления и вызовов
- два вида вызовов (call) и определений (define):
  - ABI следуют платформозависимому соглашению о вызовах и полезны для взаимодействия с
    внешним миром
  - PAF позволяют использовать устранение хвостовых вызовов (tail call elimination) и
    полезен для реализации общих управляющих структур.

* Введение

Традиционно компиляторы производят ассемблерный код для различных целевых архитектур, а
интерпретаторы были написаны на языке ассемблера. Недостатком такого подхода является
то, что он требует перенацеливания для каждой новой архитектуры. В результате многие
такие компиляторы и интерпретаторы нацелены только на одну или несколько архитектур и
портирование для новых архитектур часто занимает довольно много времени.

Переносимые ассемблеры обещают решить эту проблему: если компилятор исходного языка
компилируется в переносимый ассемблер или интерпретатор написан на переносимом
ассемблере - то в результате компилятор или интерпретатор будут работать на различных
архитектурах без дополнительных усилий.

Разумеется, реализация переносимого ассемблера должна быть нацелена на эти архитектуры,
но эти усилия могут быть использованы повторно несколькими
компиляторами/интерпретаторами.  В этой статье мы представляем новый переносимый
ассемблер, PAF (Portable Assembly Forth). Существуют несколько языков, которые были
разработаны и/или используются в качестве портируемых ассемблеров (см. [[*Предыдущие работы][предыдущие
работы]]), так зачем вводить новый?

** Вклад

Проблема, с которой столкнулись некоторые переносимые ассемблеры, заключается в том,
что они требуют, чтобы код был организован в функции, которые следуют стандартным
соглашениям о вызовах (ABI) платформы и которые обычно предотвращают (или серьезно
затрудняют) использование оптимизации хвостовых вызовов (Tail Call Optimization). PAF
предоставляет не только ABI-вызовы и определения для взаимодействия с остальным миром,
но также вызовы и определения PAF, которые (в отличие от ABI-вызовов) могут быть
оптимизированы с помощью TCO и поэтому могут использоваться как универсальные примитивы
управления.

Другая проблема заключается в том, что косвенные условные переходы и коссвенные вызовы
имеют высокую стоимость, поскольку компилятор должен предположить, что каждая ветка или
вызов могут быть направлены в любую точку программы. PAF вводит теги, чтобы указать,
какие переходы или вызовы могут достигать соответствующий точек входа точек входа (см.
[[*Поток управления внутри определений][поток управления внутри определений]] и [[*PAF определения и PAF вызовы][PAF определения и PAF вызовы]]).

Наиболее значительная разница между PAF и Forth заключается в том, что PAF содержит
ограничения, гарантирующие, что глубина стека всегда определяется статически, поэтому
элементы стека могут отображаться в регистры (см. [[*Forth и PAF][Forth и PAF]] и [[*PAF определения и PAF вызовы][PAF определения и PAF
вызовы]]). Интересно, что эти ограничения относительно незначительны и не влияют на
большую часть Forth-кода; также интересно посмотреть пример от Forth-кода, на который
они влияют (см. [[*PAF vs Forth][PAF vs Forth]]).

* Предыдущие работы
** Си

Cи и его диалекты, такие как GNU Cи, были использованы как портируемый ассемблер во
многих системах:
- это распространенный язык для написания интерпретаторов (например, Python, Ruby,
  Gforth) и систем времени выполнения;
- Си также используется в качестве целевого языка для компиляторов: (например, исходный
  С++ компилятор cfront и одна из опций кодогерации GHC).

Тем не менее, стандарт Cи специфицирует большое количество "неопределенного поведения",
включая включая вещи, которые, как ожидается, будут вести себя предсказуемо на
переносимом ассемблере, например, с переполнением целых чисел.

Ранее это не было проблемой, потому что компиляторы Си все еще делали то, что
планировал программист. К сожалению, тренд последних лет среди создателей компиляторов
Си - это оптимизация программ таким образом, что они искажают (в смысле "намерений"
программиста), код, который предыдущей версией компилятора компилировался в
соответствии с намерениями программиста.

В то время как в большинстве случаев, как правило, можно найти обходные пути для этой
проблемы, следующая версия компилятора часто производит новые проблемы, и со всеми
этими обходными решениями прямое отношение возможностей языка к в возможностям машины
теряется.

Другая проблема Си (и возможно причина почему он не используется так часто в качестве
целевого языка для интерпретаторов) - это то, что его поток управления довольно
негибкий: код разделен на Си-функции, из которых управление можно вернуть; единственный
способ изменить поток управления через функции - это вызов функции longjmp();

Varargs в сочетании с другими языковыми возможностями привели к вызовам подпрограмм, в
которых вызывающий отвечает за удаление аргументов из стека. Это делает невозможным
реализацию гарантированной оптимизации хвостовых вызовов, которая необходима для
использования вызовов Cи как общего примитива потока управления [Ste77].

В результате любой поток управления, который не соответствует Cи, например,
неограниченные хвостовые вызовы, backtracking, сопрограммы и даже исключения трудно
реализовать на Cи эффективно.

