www/doc/paf.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Forth как переносимый ассемблер</title>
<meta name="generator" content="Org mode">
<meta name="author" content="M. Anton Ertl, TU Wien">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Forth как переносимый ассемблер</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd740bb8">Abstract</a></li>
<li><a href="#org4c8f77c">Введение</a>
<ul>
<li><a href="#org2384d46">Вклад</a></li>
</ul>
</li>
<li><a href="#orgb989151">Предыдущие работы</a>
<ul>
<li><a href="#org5f81f14">Си</a></li>
<li><a href="#orgf254bb2">LLVM</a></li>
<li><a href="#org4a358fd">С--</a></li>
<li><a href="#orgdfa5f1d">Vcode and GNU Lightning</a></li>
</ul>
</li>
<li><a href="#orgb3db2dc">Portable Assembler Forth (PAF)</a>
<ul>
<li><a href="#org9be8434">Цели</a></li>
<li><a href="#org96b8d9d">Целевые машины</a></li>
<li><a href="#orgd554a77">Forth и PAF</a></li>
<li><a href="#orgfdb002d">Пример</a></li>
<li><a href="#org536b2ef">Регистры</a></li>
<li><a href="#orga3dbe93">Память</a></li>
<li><a href="#org0974e8c">Арифметика</a></li>
<li><a href="#org638b9e3">Сравнение</a></li>
<li><a href="#org3bb1ad6">Поток управления внутри определений</a></li>
<li><a href="#org688c7c8">PAF определения и PAF вызовы</a></li>
<li><a href="#org26026b3">ABI определения и ABI вызовы</a></li>
<li><a href="#orgad54ec8">Обсуждение определений и вызовов</a></li>
<li><a href="#org1edf571">Исключения</a></li>
</ul>
</li>
<li><a href="#org7332b2c">Отсутствующие возможности</a>
<ul>
<li><a href="#org12501bc">Сборка мусора</a></li>
<li><a href="#org58f170d">Типы</a></li>
<li><a href="#org0371718">Отладчик</a></li>
<li><a href="#org4033dcf">SIMD</a></li>
</ul>
</li>
<li><a href="#org87599c4">PAF vs Forth</a>
<ul>
<li><a href="#orga7f887a">Влияние на реализацию</a></li>
<li><a href="#orgfa36f3d">Влияние на программы</a></li>
<li><a href="#org54beda2">Компиляция Forth в PAF</a></li>
</ul>
</li>
<li><a href="#org854804c">Связанные работы</a></li>
<li><a href="#orgc21c6a5">Вывод</a></li>
<li><a href="#orgcf96ce0">Ссылки</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd740bb8" class="outline-2">
<h2 id="orgd740bb8">Abstract</h2>
<div class="outline-text-2" id="text-orgd740bb8">
<p>
Переносимый ассемблер, как и обычный ассемблер предоставляет доступ к аппаратным
возможностям компьютера, таким как:
</p>
<ul class="org-ul">
<li>адреса памяти</li>
<li>машинные слова</li>
<li>адреса кода</li>
<li>арифметика по модулю</li>
</ul>
<p>
но абстрагирует различия между архитектурами, такими как:
</p>
<ul class="org-ul">
<li>синтаксис ассемблера</li>
<li>кодирование команд</li>
<li>набор регистров и их размер</li>
<li>режимы адресации.</li>
</ul>

<p>
Forth уже удовлетворяет ряду характеристик переносимого ассемблера и, следовательно,
является хорошей основой.
</p>

<p>
В этом документе представлен PAF, переносимый язык ассемблера основанный на
Forth. Специально обсуждаются функции языка, которые другие переносимые ассемблеры не
имеют и их преимущества; в нем также обсуждается отличия от Forth.
</p>

<p>
Главные инновации PAF это:
</p>
<ul class="org-ul">
<li>теги, которые указывают поток управления для косвенного ветвления и вызовов</li>
<li>два вида вызовов (call) и определений (define):
<ul class="org-ul">
<li>ABI следуют платформозависимому соглашению о вызовах и полезны для взаимодействия с
внешним миром</li>
<li>PAF позволяют использовать устранение хвостовых вызовов (tail call elimination) и
полезен для реализации общих управляющих структур.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4c8f77c" class="outline-2">
<h2 id="org4c8f77c">Введение</h2>
<div class="outline-text-2" id="text-org4c8f77c">
<p>
Традиционно компиляторы производят ассемблерный код для различных целевых архитектур, а
интерпретаторы были написаны на языке ассемблера. Недостатком такого подхода является
то, что он требует перенацеливания для каждой новой архитектуры. В результате многие
такие компиляторы и интерпретаторы нацелены только на одну или несколько архитектур и
портирование для новых архитектур часто занимает довольно много времени.
</p>

<p>
Переносимые ассемблеры обещают решить эту проблему: если компилятор исходного языка
компилируется в переносимый ассемблер или интерпретатор написан на переносимом
ассемблере - то в результате компилятор или интерпретатор будут работать на различных
архитектурах без дополнительных усилий.
</p>

<p>
Разумеется, реализация переносимого ассемблера должна быть нацелена на эти архитектуры,
но эти усилия могут быть использованы повторно несколькими
компиляторами/интерпретаторами.  В этой статье мы представляем новый переносимый
ассемблер, PAF (Portable Assembly Forth). Существуют несколько языков, которые были
разработаны и/или используются в качестве портируемых ассемблеров (см. <a href="#orgb989151">предыдущие
работы</a>), так зачем вводить новый?
</p>
</div>

<div id="outline-container-org2384d46" class="outline-3">
<h3 id="org2384d46">Вклад</h3>
<div class="outline-text-3" id="text-org2384d46">
<p>
Проблема, с которой столкнулись некоторые переносимые ассемблеры, заключается в том,
что они требуют, чтобы код был организован в функции, которые следуют стандартным
соглашениям о вызовах (ABI) платформы и которые обычно предотвращают (или серьезно
затрудняют) использование оптимизации хвостовых вызовов (Tail Call Optimization). PAF
предоставляет не только ABI-вызовы и определения для взаимодействия с остальным миром,
но также вызовы и определения PAF, которые (в отличие от ABI-вызовов) могут быть
оптимизированы с помощью TCO и поэтому могут использоваться как универсальные примитивы
управления.
</p>

<p>
Другая проблема заключается в том, что косвенные условные переходы и коссвенные вызовы
имеют высокую стоимость, поскольку компилятор должен предположить, что каждая ветка или
вызов могут быть направлены в любую точку программы. PAF вводит теги, чтобы указать,
какие переходы или вызовы могут достигать соответствующий точек входа точек входа (см.
<a href="#org3bb1ad6">поток управления внутри определений</a> и <a href="#org688c7c8">PAF определения и PAF вызовы</a>).
</p>

<p>
Наиболее значительная разница между PAF и Forth заключается в том, что PAF содержит
ограничения, гарантирующие, что глубина стека всегда определяется статически, поэтому
элементы стека могут отображаться в регистры (см. <a href="#orgd554a77">Forth и PAF</a> и <a href="#org688c7c8">PAF определения и PAF
вызовы</a>). Интересно, что эти ограничения относительно незначительны и не влияют на
большую часть Forth-кода; также интересно посмотреть пример от Forth-кода, на который
они влияют (см. <a href="#org87599c4">PAF vs Forth</a>).
</p>
</div>
</div>
</div>

<div id="outline-container-orgb989151" class="outline-2">
<h2 id="orgb989151">Предыдущие работы</h2>
<div class="outline-text-2" id="text-orgb989151">
</div>
<div id="outline-container-org5f81f14" class="outline-3">
<h3 id="org5f81f14">Си</h3>
<div class="outline-text-3" id="text-org5f81f14">
<p>
Cи и его диалекты, такие как GNU Cи, были использованы как портируемый ассемблер во
многих системах:
</p>
<ul class="org-ul">
<li>это распространенный язык для написания интерпретаторов (например, Python, Ruby,
Gforth) и систем времени выполнения;</li>
<li>Си также используется в качестве целевого языка для компиляторов: (например, исходный
С++ компилятор cfront и одна из опций кодогерации GHC).</li>
</ul>

<p>
Тем не менее, стандарт Cи специфицирует большое количество "неопределенного поведения",
включая включая вещи, которые, как ожидается, будут вести себя предсказуемо на
переносимом ассемблере, например, с переполнением целых чисел.
</p>

<p>
Ранее это не было проблемой, потому что компиляторы Си все еще делали то, что
планировал программист. К сожалению, тренд последних лет среди создателей компиляторов
Си - это оптимизация программ таким образом, что они искажают (в смысле "намерений"
программиста), код, который предыдущей версией компилятора компилировался в
соответствии с намерениями программиста.
</p>

<p>
В то время как в большинстве случаев, как правило, можно найти обходные пути для этой
проблемы, следующая версия компилятора часто производит новые проблемы, и со всеми
этими обходными решениями прямое отношение возможностей языка к в возможностям машины
теряется.
</p>

<p>
Другая проблема Си (и возможно причина почему он не используется так часто в качестве
целевого языка для интерпретаторов) - это то, что его поток управления довольно
негибкий: код разделен на Си-функции, из которых управление можно вернуть; единственный
способ изменить поток управления через функции - это вызов функции longjmp();
</p>

<p>
Varargs в сочетании с другими языковыми возможностями привели к вызовам подпрограмм, в
которых вызывающий отвечает за удаление аргументов из стека. Это делает невозможным
реализацию гарантированной оптимизации хвостовых вызовов, которая необходима для
использования вызовов Cи как общего примитива потока управления [Ste77].
</p>

<p>
В результате любой поток управления, который не соответствует Cи, например,
неограниченные хвостовые вызовы, backtracking, сопрограммы и даже исключения трудно
реализовать на Cи эффективно.
</p>
</div>
</div>
