org/doc/paf.org
** LLVM

LLVM является промежуточным представлением для компиляции, с несколькими фронтендами,
проходами оптимизации и бакендами [LA04].

К сожалению, он разделяет многие проблемы Cи: в частности, вы должны разделить код на
функции, которые следуют некоторым соглашениям о вызовах, ограничивая возможные типы
потока управления. Чтобы обойти эту проблему, можно добавить ваше собственное
соглашение о вызове, но это непросто.

LLVM также обещал быть полезным промежуточным представлением для компиляторов JIT, но,
по сообщениям, его кодогенерация слишком медленная для большинства используемых
JIT-компиляторов.

LLVM поддерживает меньшее количество целевых платформ, чем C. Учитывая, что он также,
по-видимому, разделяет многие из недостатков C, он не выглядит привлекательным
переносимым ассемблером, несмотря на весь тот шум, который он генеририрует.

** С--

C-- [JRR99] был разработан как переносимый язык ассемблера. Многие соображения вошли в
его дизайн, и, похоже, он хорошо разработан, если не считать того, что он слишком
сложен на мой вкус, но проект, похоже, застопорился как общий переносимый язык
ассемблера и, похоже, стал внутренним компонентом GHC (так называемый Cmm).

В то время как C--, похоже, не является вариантом переносимого ассемблера для
использования в практических проектах на данный момент - его дизайн в качестве
вдохновения - неплохая идея.

** Vcode and GNU Lightning

Vcode [Eng96] - это библиотека, которая обеспечивает низкоуровневый интерфейс для
быстрой генерации собственного кода (10 выполненных команд для генерации одной команды)
и делает это переносимо. Она была частью исследовательского проекта и не имела
широкоизвестного релиза, но она вдохновила проект GNU Lightning.

Требования чрезвычайно быстрой кодогенерации означают, что GNU Lightning не может
самостоятельно выполнять распределение регистров. Поэтому фронтэнд должен выполнить
распределение регистров. Он также не выполняет выбор команд; каждая инструкция GNU
Lightning переводится, по крайней мере, в одну нативную инструкцию.

GNU Lightning также делит код на функции, которые следуют стандартным соглашениям о
вызовах, и можно вызывать функции в соответствии с соглашением о вызове. Тем не менее,
также можно реализовать свои собственные соглашения о вызовах и другие виды потока
управления, поскольку фронтенд контролирует распределение регистров. Но (из чтения
руководства) неясно, можно ли это интегрировать с обработкой стека GNU Lightning если
вы используете инструкцию процессора call для своего собственного соглашения о вызове.

Можно использовать лучшую технологию генерации кода с интерфейсом GNU Lightning, а
также предоставить способы использования инструкций по вызову и возврату процессора для
вашего собственного соглашения о вызовах.

С этими изменениями не будет ли интерфейс GNU Lightning идеальным переносимым
ассемблером? Он, безусловно, удовлетворит основные требования переносимого ассемблера,
но в качестве замены языка, такого как C, он пропускает такие удобства, как
распределение регистров.

* Portable Assembler Forth (PAF)
** Цели

- Переносимость: Работает на нескольких разных архитектурах
- Прямое соотношение между возможностями языка и возможностями машины, то есть, если вы
  посмотрите на фрагмент кода PAF, вы можете предсказать, как будет выглядеть машинный
  код.  Однако отношение между PAF и машиной не настолько прямое, как для GNU
  Lightning: существует регистровая аллокация и выбор команд (instruction selection),
  может быть планирование команд (instruction scheduling) и репликация кода (code
  replication). Выбор команд и планирование команд делают возможным лучший код (за счет
  более медленной компиляции); распределение регистров взаимодействует с этими этапами,
  и оставляя его для клиентов. Требуется дублирование работы в клиентах, поскольку
  распределение регистров на самом деле не зависит от языка.
- Возможности (пользовательская часть) машины могут быть выражены в PAF. Однако эта
  цель смягчается потребностями клиентов и целью мобильности. Таким образом, PAF
  сначала будет иметь только те возможности языка, которые могут потребоваться
  компиляторам и интерпретаторам (функции могут быть добавлены, когда клиенты нуждаются
  в них); и машинные возможности конкретных архитектур, которые не могут быть
  абстрагированы на языковые функции. Возможности, которые могут быть разумно
  реализованы этим способом на всех целевых целевых машинах, также не будут
  поддерживаться в качестве машинно-ориентированных.

** Целевые машины

Хотя переносимый язык ассемблера может иметь некоторые отличия между архитектурами,
есть различия, которые слишком сложно преодолеть. Попытка сделать это приведет к тому,
что PAF будет слишком далек от идеи прямого соответствия между языковыми и
архитектурными особенностями, поэтому здесь мы определяем класс машин, на которые мы
нацеливаем PAF:

PAF нацелин на компьютерные архитектуры общего назначения, то есть архитектуры, которые
были разработаны как целевые для компиляторов, такие как:
- AMD64
- ARM
- IA-32
- IA-64
- MIPS
- PowerPC,
- SPARC

Память на целевых компьютерах адресована байтами с использованием плоского адресного
пространства. Так, например, DSP с отдельными адресными пространствами X и Y не
являются целевыми машинами. Целевые машины используют по модулю арифметику (wrap
around), а знаковые числа представлены в "дополнительном коде".

Целевые машины имеют единый набор регистров для целых чисел и адресов (а не, например,
регистры-аккумуляторы с другим размером, чем регистры адресов) и, возможно, отдельные
(но внутренние и равномерные) регистры с плавающей запятой.

** Forth и PAF

Низкоуровневые функции Forth довольно близки к ассемблеру; например, как на языке
ассемблера, ни компилятор, ни система времени выполнения не поддерживают систему типов,
а язык различает различные операции на основе имени, а не на основе типа; например,
Forth имеет ~<~ для знакового сравнения и ~U<~ для беззнакового сравнения ячеек
(машинных слов), так же, как MIPS имеет ~slt~ и ~sltu~, а Alpha имеет ~cmplt~ и
~cmpult~.

Поэтому Forth - хорошая основа для переносимого ассемблера. Тем не менее, в этом
контексте есть проблемы: в частности, в Forth глубина стека не обязательно статически
определена (в отличие от JVM), хотя почти во всем коде Forth глубина стека фактически
статически определяется (известна программисту на этапе компиляции, но не всегда
известна Forth-системе). Поэтому мы изменяем эти языковые аспекты для PAF.

Ряд высокоуровневых функций Forth выходит за рамки переносимого ассемблера, поэтому PAF
не поддерживает их.

С другой стороны, есть несколько вещей, которые отсутствуют в стандартном Форте,
которые необходимо добавить в PAF, например слова для доступа к 16-разрядным величинам
в памяти.

