www/doc/paf.html

<div id="outline-container-orgf254bb2" class="outline-3">
<h3 id="orgf254bb2">LLVM</h3>
<div class="outline-text-3" id="text-orgf254bb2">
<p>
LLVM является промежуточным представлением для компиляции, с несколькими фронтендами,
проходами оптимизации и бакендами [LA04].
</p>

<p>
К сожалению, он разделяет многие проблемы Cи: в частности, вы должны разделить код на
функции, которые следуют некоторым соглашениям о вызовах, ограничивая возможные типы
потока управления. Чтобы обойти эту проблему, можно добавить ваше собственное
соглашение о вызове, но это непросто.
</p>

<p>
LLVM также обещал быть полезным промежуточным представлением для компиляторов JIT, но,
по сообщениям, его кодогенерация слишком медленная для большинства используемых
JIT-компиляторов.
</p>

<p>
LLVM поддерживает меньшее количество целевых платформ, чем C. Учитывая, что он также,
по-видимому, разделяет многие из недостатков C, он не выглядит привлекательным
переносимым ассемблером, несмотря на весь тот шум, который он генеририрует.
</p>
</div>
</div>

<div id="outline-container-org4a358fd" class="outline-3">
<h3 id="org4a358fd">С--</h3>
<div class="outline-text-3" id="text-org4a358fd">
<p>
C&#x2013; [JRR99] был разработан как переносимый язык ассемблера. Многие соображения вошли в
его дизайн, и, похоже, он хорошо разработан, если не считать того, что он слишком
сложен на мой вкус, но проект, похоже, застопорился как общий переносимый язык
ассемблера и, похоже, стал внутренним компонентом GHC (так называемый Cmm).
</p>

<p>
В то время как C&#x2013;, похоже, не является вариантом переносимого ассемблера для
использования в практических проектах на данный момент - его дизайн в качестве
вдохновения - неплохая идея.
</p>
</div>
</div>

<div id="outline-container-orgdfa5f1d" class="outline-3">
<h3 id="orgdfa5f1d">Vcode and GNU Lightning</h3>
<div class="outline-text-3" id="text-orgdfa5f1d">
<p>
Vcode [Eng96] - это библиотека, которая обеспечивает низкоуровневый интерфейс для
быстрой генерации собственного кода (10 выполненных команд для генерации одной команды)
и делает это переносимо. Она была частью исследовательского проекта и не имела
широкоизвестного релиза, но она вдохновила проект GNU Lightning.
</p>

<p>
Требования чрезвычайно быстрой кодогенерации означают, что GNU Lightning не может
самостоятельно выполнять распределение регистров. Поэтому фронтэнд должен выполнить
распределение регистров. Он также не выполняет выбор команд; каждая инструкция GNU
Lightning переводится, по крайней мере, в одну нативную инструкцию.
</p>

<p>
GNU Lightning также делит код на функции, которые следуют стандартным соглашениям о
вызовах, и можно вызывать функции в соответствии с соглашением о вызове. Тем не менее,
также можно реализовать свои собственные соглашения о вызовах и другие виды потока
управления, поскольку фронтенд контролирует распределение регистров. Но (из чтения
руководства) неясно, можно ли это интегрировать с обработкой стека GNU Lightning если
вы используете инструкцию процессора call для своего собственного соглашения о вызове.
</p>

<p>
Можно использовать лучшую технологию генерации кода с интерфейсом GNU Lightning, а
также предоставить способы использования инструкций по вызову и возврату процессора для
вашего собственного соглашения о вызовах.
</p>

<p>
С этими изменениями не будет ли интерфейс GNU Lightning идеальным переносимым
ассемблером? Он, безусловно, удовлетворит основные требования переносимого ассемблера,
но в качестве замены языка, такого как C, он пропускает такие удобства, как
распределение регистров.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb3db2dc" class="outline-2">
<h2 id="orgb3db2dc">Portable Assembler Forth (PAF)</h2>
<div class="outline-text-2" id="text-orgb3db2dc">
</div>
<div id="outline-container-org9be8434" class="outline-3">
<h3 id="org9be8434">Цели</h3>
<div class="outline-text-3" id="text-org9be8434">
<ul class="org-ul">
<li>Переносимость: Работает на нескольких разных архитектурах</li>
<li>Прямое соотношение между возможностями языка и возможностями машины, то есть, если вы
посмотрите на фрагмент кода PAF, вы можете предсказать, как будет выглядеть машинный
код.  Однако отношение между PAF и машиной не настолько прямое, как для GNU
Lightning: существует регистровая аллокация и выбор команд (instruction selection),
может быть планирование команд (instruction scheduling) и репликация кода (code
replication). Выбор команд и планирование команд делают возможным лучший код (за счет
более медленной компиляции); распределение регистров взаимодействует с этими этапами,
и оставляя его для клиентов. Требуется дублирование работы в клиентах, поскольку
распределение регистров на самом деле не зависит от языка.</li>
<li>Возможности (пользовательская часть) машины могут быть выражены в PAF. Однако эта
цель смягчается потребностями клиентов и целью мобильности. Таким образом, PAF
сначала будет иметь только те возможности языка, которые могут потребоваться
компиляторам и интерпретаторам (функции могут быть добавлены, когда клиенты нуждаются
в них); и машинные возможности конкретных архитектур, которые не могут быть
абстрагированы на языковые функции. Возможности, которые могут быть разумно
реализованы этим способом на всех целевых целевых машинах, также не будут
поддерживаться в качестве машинно-ориентированных.</li>
</ul>
</div>
</div>

<div id="outline-container-org96b8d9d" class="outline-3">
<h3 id="org96b8d9d">Целевые машины</h3>
<div class="outline-text-3" id="text-org96b8d9d">
<p>
Хотя переносимый язык ассемблера может иметь некоторые отличия между архитектурами,
есть различия, которые слишком сложно преодолеть. Попытка сделать это приведет к тому,
что PAF будет слишком далек от идеи прямого соответствия между языковыми и
архитектурными особенностями, поэтому здесь мы определяем класс машин, на которые мы
нацеливаем PAF:
</p>

<p>
PAF нацелин на компьютерные архитектуры общего назначения, то есть архитектуры, которые
были разработаны как целевые для компиляторов, такие как:
</p>
<ul class="org-ul">
<li>AMD64</li>
<li>ARM</li>
<li>IA-32</li>
<li>IA-64</li>
<li>MIPS</li>
<li>PowerPC,</li>
<li>SPARC</li>
</ul>

<p>
Память на целевых компьютерах адресована байтами с использованием плоского адресного
пространства. Так, например, DSP с отдельными адресными пространствами X и Y не
являются целевыми машинами. Целевые машины используют по модулю арифметику (wrap
around), а знаковые числа представлены в "дополнительном коде".
</p>

<p>
Целевые машины имеют единый набор регистров для целых чисел и адресов (а не, например,
регистры-аккумуляторы с другим размером, чем регистры адресов) и, возможно, отдельные
(но внутренние и равномерные) регистры с плавающей запятой.
</p>
</div>
</div>

<div id="outline-container-orgd554a77" class="outline-3">
<h3 id="orgd554a77">Forth и PAF</h3>
<div class="outline-text-3" id="text-orgd554a77">
<p>
Низкоуровневые функции Forth довольно близки к ассемблеру; например, как на языке
ассемблера, ни компилятор, ни система времени выполнения не поддерживают систему типов,
а язык различает различные операции на основе имени, а не на основе типа; например,
Forth имеет <code>&lt;</code> для знакового сравнения и <code>U&lt;</code> для беззнакового сравнения ячеек
(машинных слов), так же, как MIPS имеет <code>slt</code> и <code>sltu</code>, а Alpha имеет <code>cmplt</code> и
<code>cmpult</code>.
</p>

<p>
Поэтому Forth - хорошая основа для переносимого ассемблера. Тем не менее, в этом
контексте есть проблемы: в частности, в Forth глубина стека не обязательно статически
определена (в отличие от JVM), хотя почти во всем коде Forth глубина стека фактически
статически определяется (известна программисту на этапе компиляции, но не всегда
известна Forth-системе). Поэтому мы изменяем эти языковые аспекты для PAF.
</p>

<p>
Ряд высокоуровневых функций Forth выходит за рамки переносимого ассемблера, поэтому PAF
не поддерживает их.
</p>

<p>
С другой стороны, есть несколько вещей, которые отсутствуют в стандартном Форте,
которые необходимо добавить в PAF, например слова для доступа к 16-разрядным величинам
в памяти.
</p>
</div>
</div>
