org/doc/paf.org
** Пример

В следующем примере показаны два определения, написанные в PAF

#+BEGIN_SRC forth
                           \  cmpl %edx,%eax
  : max                    \  jle L28
      2dup >? if           \  ret
          drop exit endif  \ L28:
      nip exit ;           \  movl %edx,%eax
                           \  ret

  abi:xx- printmax {: n1 n2 -- :}
    "max(%ld,%ld)=%ld\n\0" drop
    n1 n2 2dup max abi.printf.xxxx-
    exit ;

  \ Call from C:
  \ main() { printmax(3,5); return 0; }
#+END_SRC

Первое определение, ~max~, выглядит почти как обычный код Forth, а соответствующий код языка
ассемблера для IA-32 показан в комментариях справа.

~max~ не имеет зафиксированного соглашения о вызове; компилятор PAF может установить
соглашение о вызове, которое подходит для max и его вызывающих процедур (например, это
может быть ~tail-called~.

Поскольку max не соответствует соглашению о вызовах платформы, он не может быть вызван,
например, кодом C.

Второе определение, ~printmax~, соответствует стандарту ABI платформы (как указано с
помощью слова ~abi:~) слово определения. ~xx-~ в ~abi:xx-~ показывает, что ~printmax~
ожидает и потребляет два целочисленных значения из стека данных и 0 плавающих значений
из FP и создает 0 целочисленных и 0 плавающих. Прототип Си для этого определения может
быть ~void printmax (long, long)~.

~Printmax~ вызывает ~max~, и компилятор может выбрать вызывающий интерфейс между
вызывающим и ~max~; он вызывает ~printf~, используя стандартное соглашение о вызове с
вызовом ~abi.printf.xxxx-~, где ~xxxx-~ указывает, что четыре ячейки передаются как
параметры integer/address, а возвращаемое значение ~printf~ игнорируется.

Локальные переменные используются в ~printmax~, но могут использоваться в каждом
определении. Выход из определений является явным.

** Регистры

Некоторые языковые возможности прямо соответствуют реальным машинным регистрам:
элементы стека, локальные переменные и значения.
- *Элементы стека* (stack items) полезны для относительно недолговечных данных и (в
  отличие от локальных переменных (locals) могут использоваться для передачи аргументов
  и возвращаемых значений. Для стека нет указателя стека и области памяти, это просто
  абстракция, используемая компилятором. Слова манипуляции стеками, такие как DUP или
  SWAP, просто изменяют поток данных, и нет соответствующего им машинного кода
  (косвенными последствиями могут быть, например, move-инструкции при формировании
  потока управления).
- *Локальные переменные* (locals) живут в пределах определения и являются удобством:
  локальные переменные исходного языка могут быть сопоставлены непосредственно с
  локальными переменными PAF с отсутствием необходимости в распределении регистров или
  управлении стеком на фронтенде. Если источник локальной переменой должен быть
  распределен по нескольким определениям PAF (например, потому что структура управления
  исходного языка отображается на хвостовой вызов PAF), локальная переменная может быть
  определена в каждом из этих определений, а константы передаются в стек между
  вызовами; это не так удобно, как хотелось бы, но, похоже, является хорошим
  компромиссом.
- *Значения* (values) представляют собой глобальные (локальные в пределах потока)
  переменные, адрес которых не может быть взят, поэтому они могут храниться в
  регистрах.

Если элементы стека и локальные объекты не помещаются в регистры, они сохраняются в
стеке, который не отображается в PAF коде; этот стек хранит элементы из данных и стека
FP, locals и адресов возврата, так что это не соответствует представлению памяти,
например, стека данных.

Некоторые языки имеют локальные переменные, адрес которых можно взять; может быть
хорошей идеей предоставить способ сохранить их в этом стеке в конечном счете, но на
данный момент такие переменные должны храниться в другом месте. Взаимодействие такого
признака с, например, хвостовыми вызовами следует рассматривать в первую очередь.

Если значения не помещаются в регистры, они сохраняются в глобальной/thread-local
памяти.

** Память

Слова ~c@~ ~uw@~ ~ul@~ ~( addr -- u )~ загружают беззнаковые 8/16/32-битные значения из
памяти, а ~sc@~ ~w@~ ~l@~ ~( addr -- n )~ загружают знаковые 8/16/32-битные значения;
~@ (addr -- w)~ загружают ячейку (32-битную или 64-биную, в зависимости от архитектуры)
из памяти; ~sf@~ ~df@~ ~( addr -- r )~ загружают 32/64-bit значения с плавающей точкой
из памяти. ~c!~  ~w!~  ~l!~ ~!~  ~( x addr -- )~ и ~sf!~  ~df!~  ~( r addr --)~ сохраняют элементы
из стека в память.

** Арифметика

Обычные Forth-слова ~+~ ~-~ ~*~ ~NEGATE~ ~AND~ ~OR~ ~INVERT~ ~LSHIFT~ ~RSHIFT~ соответствуют
арифметическим и логическим инструкциям, присутствующим на каждой машине.

Существуют также дополнительные слова типа ~/~ ~m*~ ~um*~ ~um/mod~ ~sm/rem~ которые
соответствуют инструкциям некоторых машин и их необходимо синтезировать из других
инструкций на машинах, на которых нет не соответствующих команд.

** Сравнение

Слова ~=?~ ~<?~ ~u<?~ ~f=?~ ~f<?~ и тому подобные сравнивают два элемента стека и
возвращают ~0~ на стеке если ~false~ и ~1~ если ~true~.  Они соответствуют Forth-словам
~=~ ~<~ ~u<~ ~f=~ ~f<~ и подобным с той разницей, что Forth-слова возвращают ~-1~ (все
биты установлены) когда ~true~.

У ряда машин есть инструкции, которые производят "~0~ или ~1~" (MIPS, Alpha, IA-32,
AMD64), тогда как для других так же легко получить "~0~ или ~1~", чтобы произвести "~0~
или ~-1~", поэтому "~0~ или ~1~" больше соответствует цели прямого обращения к
возможностям машины. Реализация языка "~0~ или ~-1~", такого как Forth, будет
использовать последовательность, подобную ~<? negate~, для которого хороший код может
быть создан очень просто.

