www/doc/paf.html

<div id="outline-container-orgfdb002d" class="outline-3">
<h3 id="orgfdb002d">Пример</h3>
<div class="outline-text-3" id="text-orgfdb002d">
<p>
В следующем примере показаны два определения, написанные в PAF
</p>

<div class="org-src-container">
<pre class="src src-forth">                         \  cmpl %edx,%eax
: max                    \  jle L28
    2dup &gt;? if           \  ret
        drop exit endif  \ L28:
    nip exit ;           \  movl %edx,%eax
                         \  ret

abi:xx- printmax {: n1 n2 -- :}
  "max(%ld,%ld)=%ld\n\0" drop
  n1 n2 2dup max abi.printf.xxxx-
  exit ;

\ Call from C:
\ main() { printmax(3,5); return 0; }
</pre>
</div>

<p>
Первое определение, <code>max</code>, выглядит почти как обычный код Forth, а соответствующий код языка
ассемблера для IA-32 показан в комментариях справа.
</p>

<p>
<code>max</code> не имеет зафиксированного соглашения о вызове; компилятор PAF может установить
соглашение о вызове, которое подходит для max и его вызывающих процедур (например, это
может быть <code>tail-called</code>.
</p>

<p>
Поскольку max не соответствует соглашению о вызовах платформы, он не может быть вызван,
например, кодом C.
</p>

<p>
Второе определение, <code>printmax</code>, соответствует стандарту ABI платформы (как указано с
помощью слова <code>abi:</code>) слово определения. <code>xx-</code> в <code>abi:xx-</code> показывает, что <code>printmax</code>
ожидает и потребляет два целочисленных значения из стека данных и 0 плавающих значений
из FP и создает 0 целочисленных и 0 плавающих. Прототип Си для этого определения может
быть <code>void printmax (long, long)</code>.
</p>

<p>
<code>Printmax</code> вызывает <code>max</code>, и компилятор может выбрать вызывающий интерфейс между
вызывающим и <code>max</code>; он вызывает <code>printf</code>, используя стандартное соглашение о вызове с
вызовом <code>abi.printf.xxxx-</code>, где <code>xxxx-</code> указывает, что четыре ячейки передаются как
параметры integer/address, а возвращаемое значение <code>printf</code> игнорируется.
</p>

<p>
Локальные переменные используются в <code>printmax</code>, но могут использоваться в каждом
определении. Выход из определений является явным.
</p>
</div>
</div>

<div id="outline-container-org536b2ef" class="outline-3">
<h3 id="org536b2ef">Регистры</h3>
<div class="outline-text-3" id="text-org536b2ef">
<p>
Некоторые языковые возможности прямо соответствуют реальным машинным регистрам:
элементы стека, локальные переменные и значения.
</p>
<ul class="org-ul">
<li><b>Элементы стека</b> (stack items) полезны для относительно недолговечных данных и (в
отличие от локальных переменных (locals) могут использоваться для передачи аргументов
и возвращаемых значений. Для стека нет указателя стека и области памяти, это просто
абстракция, используемая компилятором. Слова манипуляции стеками, такие как DUP или
SWAP, просто изменяют поток данных, и нет соответствующего им машинного кода
(косвенными последствиями могут быть, например, move-инструкции при формировании
потока управления).</li>
<li><b>Локальные переменные</b> (locals) живут в пределах определения и являются удобством:
локальные переменные исходного языка могут быть сопоставлены непосредственно с
локальными переменными PAF с отсутствием необходимости в распределении регистров или
управлении стеком на фронтенде. Если источник локальной переменой должен быть
распределен по нескольким определениям PAF (например, потому что структура управления
исходного языка отображается на хвостовой вызов PAF), локальная переменная может быть
определена в каждом из этих определений, а константы передаются в стек между
вызовами; это не так удобно, как хотелось бы, но, похоже, является хорошим
компромиссом.</li>
<li><b>Значения</b> (values) представляют собой глобальные (локальные в пределах потока)
переменные, адрес которых не может быть взят, поэтому они могут храниться в
регистрах.</li>
</ul>

<p>
Если элементы стека и локальные объекты не помещаются в регистры, они сохраняются в
стеке, который не отображается в PAF коде; этот стек хранит элементы из данных и стека
FP, locals и адресов возврата, так что это не соответствует представлению памяти,
например, стека данных.
</p>

<p>
Некоторые языки имеют локальные переменные, адрес которых можно взять; может быть
хорошей идеей предоставить способ сохранить их в этом стеке в конечном счете, но на
данный момент такие переменные должны храниться в другом месте. Взаимодействие такого
признака с, например, хвостовыми вызовами следует рассматривать в первую очередь.
</p>

<p>
Если значения не помещаются в регистры, они сохраняются в глобальной/thread-local
памяти.
</p>
</div>
</div>

<div id="outline-container-orga3dbe93" class="outline-3">
<h3 id="orga3dbe93">Память</h3>
<div class="outline-text-3" id="text-orga3dbe93">
<p>
Слова <code>c@</code> <code>uw@</code> <code>ul@</code> <code>( addr -- u )</code> загружают беззнаковые 8/16/32-битные значения из
памяти, а <code>sc@</code> <code>w@</code> <code>l@</code> <code>( addr -- n )</code> загружают знаковые 8/16/32-битные значения;
<code>@ (addr -- w)</code> загружают ячейку (32-битную или 64-биную, в зависимости от архитектуры)
из памяти; <code>sf@</code> <code>df@</code> <code>( addr -- r )</code> загружают 32/64-bit значения с плавающей точкой
из памяти. <code>c!</code>  <code>w!</code>  <code>l!</code> <code>!</code>  <code>( x addr -- )</code> и <code>sf!</code>  <code>df!</code>  <code>( r addr --)</code> сохраняют элементы
из стека в память.
</p>
</div>
</div>

<div id="outline-container-org0974e8c" class="outline-3">
<h3 id="org0974e8c">Арифметика</h3>
<div class="outline-text-3" id="text-org0974e8c">
<p>
Обычные Forth-слова <code>+</code> <code>-</code> <code>*</code> <code>NEGATE</code> <code>AND</code> <code>OR</code> <code>INVERT</code> <code>LSHIFT</code> <code>RSHIFT</code> соответствуют
арифметическим и логическим инструкциям, присутствующим на каждой машине.
</p>

<p>
Существуют также дополнительные слова типа <code>/</code> <code>m*</code> <code>um*</code> <code>um/mod</code> <code>sm/rem</code> которые
соответствуют инструкциям некоторых машин и их необходимо синтезировать из других
инструкций на машинах, на которых нет не соответствующих команд.
</p>
</div>
</div>

<div id="outline-container-org638b9e3" class="outline-3">
<h3 id="org638b9e3">Сравнение</h3>
<div class="outline-text-3" id="text-org638b9e3">
<p>
Слова <code>=?</code> <code>&lt;?</code> <code>u&lt;?</code> <code>f=?</code> <code>f&lt;?</code> и тому подобные сравнивают два элемента стека и
возвращают <code>0</code> на стеке если <code>false</code> и <code>1</code> если <code>true</code>.  Они соответствуют Forth-словам
<code>=</code> <code>&lt;</code> <code>u&lt;</code> <code>f=</code> <code>f&lt;</code> и подобным с той разницей, что Forth-слова возвращают <code>-1</code> (все
биты установлены) когда <code>true</code>.
</p>

<p>
У ряда машин есть инструкции, которые производят "<code>0</code> или <code>1</code>" (MIPS, Alpha, IA-32,
AMD64), тогда как для других так же легко получить "<code>0</code> или <code>1</code>", чтобы произвести "<code>0</code>
или <code>-1</code>", поэтому "<code>0</code> или <code>1</code>" больше соответствует цели прямого обращения к
возможностям машины. Реализация языка "<code>0</code> или <code>-1</code>", такого как Forth, будет
использовать последовательность, подобную <code>&lt;? negate</code>, для которого хороший код может
быть создан очень просто.
</p>
</div>
</div>
