org/doc/paf.org
** Поток управления внутри определений

Стандартные Forth-слова BEGIN AGAIN UNTIL AHEAD UNTIL AHEAD IF THEN CS-ROLL доступны в
PAF и полезны для построения структурированного потока управления, такого как ~if ...
then ...  elsif ... then ...  else ...  end~.

Хотя можно построить любой поток управления с помощью этих слов [Bad90], если вы хотите
реализовать метки и переходы, проще использовать метки и переходы.

Следовательно, PAF (в отличие от Forth) также предусматривает:
- слова ~L:name~, которые определяет метки
- слова ~goto:name~, которые осуществляет переход на метку.

PAF также поддерживает непрямые переходы:
- ~`name/tag~ выдает адрес метки ~name~ на стек
- ~goto/tag~ переходит на метку, лежащую на вершине стека.

*Тег* (tag) указывает, какие переходы могут переходить на какие метки; программа PAF не должна
переходить на адрес метки, сгенерированный с другим тегом. Например, C-компилятор C,
предназначенный для PAF, может использовать отдельный тег для каждого оператора switch
и имеющихся там меток.

Эти теги полезны для распределения регистров. Можно использовать разные теги при
одновременном использовании адреса одной и той же метки, и это может привести к разным
адресам меток, причем код на каждом целевом адресе совпадает с переходами, которые
используют этот тег (т.е. будет несколько точек входа для одной и той же PAF-метки).

Какой бы метод потока управления вы ни использовали, при соединении потока управления
статическая глубина стека должна быть одинаковой во всех соединениях потоков
управления. Это гарантирует, что компилятор PAF всегда может определять глубину стека и
может отображать элементы стека в регистры даже через поток управления. Это ограничение
по сравнению с Forth, но большинство Forth-кода соответствует этому
ограничению. Нарушение этого правила обнаруживается и сообщается как ошибка
компилятором PAF.

Таким образом, теги имеют еще одно преимущество в связи с правилом глубины стека:
статическая глубина стека для данного тега должна быть одинаковой (для всех меток и
всех переходов), но она может быть разннй для разных тегов. Если бы не было меток, все
метки и переходы в определении должны были иметь ту же самую глубину стека.

** PAF определения и PAF вызовы

Определение, в котором компилятор может свободно определять интерфейс вызова,
определяется классическим способом Forth:

#+BEGIN_SRC forth
  : name ... exit ;
#+END_SRC

Конец определения не делает неявный возврат (в отличие от Forth), поэтому вам нужно
вернуться явно, написав EXIT.

Вы вызываете такое определение, вызывая его имя, т.е. традиционным для Forth
образом. Вы можете явно вызвать такое определение с помощью ~jump:name~; это может быть
написано явно, в духе портатабельного ассемблера. Оптимизация неявных хвостовых вызовов
не является сложной задачей, поэтому компилятор PAF тоже может это сделать.

Мы можем взять адрес определения с помощью ~`name:tag~ и вызывать его с ~exec.tag~ с
оптимизацией хвостового вызова как ~jump.tag~. Тэг указывает, какие вызовы могут
вызывать определение.

Эффекты стека всех определений, адреса которых взяты с тем же тегом, должны быть
совместимы. То есть, должен быть один эффект стека, который описывает все из них,
например: ~( x x -- x )~ - это валидный эффект стека и для ~+~ и для ~DROP~, (хотя
минимальный эффект стека для DROP это ~( x -- )~ так что ~+~ и ~DROP~ имеют совместимые
стековые эффекты).

Использование тегов здесь имеет две цели:
- информирует компилятор PAF о потоке управления;
- сообщает об эффекте стека косвенного вызова (в то время как компилятор обычного Forth
  предполагает, что EXECUTE может вызвать что угодно и иметь какой-угодно эффект
  стека). Или, наоборот, в связи с правилом глубины стека: теги допускают различные
  эффекты стека для косвенно вызываемых определений с разными тегами; без тегов, все
  косвенно вызываемые определения должны иметь одинаковый эффект стека.

** ABI определения и ABI вызовы

Нам нужно явно указать эффект стека как сигнатуру определения или вызова
ABI. Синтаксисом такой сигнатуры является ~[xr]*-[xr]*~, где ~x~ указывает аргумент
ячейки (машинное слово/integer/адрес), а ~r~ - аргумент с плавающей запятой; буквы до
тире указывают параметры, а буквы после тире - результаты. Разделение на ~x~ и ~r~
отражает деление на регистры общего назначения и регистры с плавающей запятой на
реальных машинах и роль, которую эти регистры играют во многих соглашениях о вызовах.

Определение, соответствующее вызывающему соглашению определяется с помощью ~abi:sig
name~. Sig указывает эффект стека и указывает соответствие между параметрами ABI и
элементами стека PAF. Эта сигнатура не является достаточно избыточной, например,
рассмотрим разницу между следующими определениями:

#+BEGIN_SRC forth
  abi:x-x  id   exit ;
#+END_SRC

и

#+BEGIN_SRC forth
  abi:-    noop exit ;
#+END_SRC

Эти определения различаются только сигнатурой, но они ведут себя по-разному: id
возвращает свой аргумент, noop нет, и в соглашениях об ABI-вызовах обычно существует
разница между этими поведениями.

Вы можете вызвать ABI-совместимую функцию с помощью ~abi.name.sig~, где ~name~ - это
имя функции (которая может быть определением PAF или функцией, написанной на другом
языке и динамически или статически связанной с программой PAF). Подпись определяет,
сколько и какие типы элементов стека передаются вызываемым функциям, и какой тип
возвращаемого значения (если есть), чтобы push-ить его на стек.

Включение подписи в каждый вызове может быть немного утомительным повторением для
программистов-людей, но PAF в основном предназначен как промежуточный язык, и
преимущество этой схемы заключается в том, что разные вызовы одной и той же функции
(например, printf) могут иметь разные эффекты стека.

Вы можете взять адрес ABI функции с именем ~abi`name~ и вызвать его с помощью
~abi-exec.sig~. Нет никаких хвостовых вызовов для функций ABI, потому что мы не можем
гарантировать, что хвостовые вызовы могут быть оптимизированы во всех соглашениях о
вызовах.

В отличие от определений PAF, для функций ABI нет смысла отмечать эти адреса функций,
поскольку вызов всегда использует соглашение о вызове ABI (тогда как компилятор может
определить вызывающий интерфейс для вызовов PAF). Подпись в косвенных вызовах ABI имеет
такое же значение, как и в прямых вызовах ABI.

** Обсуждение определений и вызовов

Почему существуют два типа определений и два вида вызовов?  Определения и вызовы PAF
позволяют реализовать различные структуры управления, такие как backtrackng через
хвостовые вызовы [Ste77]. Они также позволяют компилятору использовать гибкие и,
возможно, более эффективные интерфейсы вызовов, чем соглашение о вызове ABI.

С другой стороны, ABI позволяют взаимодействовать с другими языками и использовать
динамически или статически связанные двоичные библиотеки, включая callback-и, и
использовать PAF для создания таких библиотек (например, в качестве плагинов).

