www/doc/paf.html

<div id="outline-container-org3bb1ad6" class="outline-3">
<h3 id="org3bb1ad6">Поток управления внутри определений</h3>
<div class="outline-text-3" id="text-org3bb1ad6">
<p>
Стандартные Forth-слова BEGIN AGAIN UNTIL AHEAD UNTIL AHEAD IF THEN CS-ROLL доступны в
PAF и полезны для построения структурированного потока управления, такого как <code>if ...
then ...  elsif ... then ...  else ...  end</code>.
</p>

<p>
Хотя можно построить любой поток управления с помощью этих слов [Bad90], если вы хотите
реализовать метки и переходы, проще использовать метки и переходы.
</p>

<p>
Следовательно, PAF (в отличие от Forth) также предусматривает:
</p>
<ul class="org-ul">
<li>слова <code>L:name</code>, которые определяет метки</li>
<li>слова <code>goto:name</code>, которые осуществляет переход на метку.</li>
</ul>

<p>
PAF также поддерживает непрямые переходы:
</p>
<ul class="org-ul">
<li><code>`name/tag</code> выдает адрес метки <code>name</code> на стек</li>
<li><code>goto/tag</code> переходит на метку, лежащую на вершине стека.</li>
</ul>

<p>
<b>Тег</b> (tag) указывает, какие переходы могут переходить на какие метки; программа PAF не должна
переходить на адрес метки, сгенерированный с другим тегом. Например, C-компилятор C,
предназначенный для PAF, может использовать отдельный тег для каждого оператора switch
и имеющихся там меток.
</p>

<p>
Эти теги полезны для распределения регистров. Можно использовать разные теги при
одновременном использовании адреса одной и той же метки, и это может привести к разным
адресам меток, причем код на каждом целевом адресе совпадает с переходами, которые
используют этот тег (т.е. будет несколько точек входа для одной и той же PAF-метки).
</p>

<p>
Какой бы метод потока управления вы ни использовали, при соединении потока управления
статическая глубина стека должна быть одинаковой во всех соединениях потоков
управления. Это гарантирует, что компилятор PAF всегда может определять глубину стека и
может отображать элементы стека в регистры даже через поток управления. Это ограничение
по сравнению с Forth, но большинство Forth-кода соответствует этому
ограничению. Нарушение этого правила обнаруживается и сообщается как ошибка
компилятором PAF.
</p>

<p>
Таким образом, теги имеют еще одно преимущество в связи с правилом глубины стека:
статическая глубина стека для данного тега должна быть одинаковой (для всех меток и
всех переходов), но она может быть разннй для разных тегов. Если бы не было меток, все
метки и переходы в определении должны были иметь ту же самую глубину стека.
</p>
</div>
</div>

<div id="outline-container-org688c7c8" class="outline-3">
<h3 id="org688c7c8">PAF определения и PAF вызовы</h3>
<div class="outline-text-3" id="text-org688c7c8">
<p>
Определение, в котором компилятор может свободно определять интерфейс вызова,
определяется классическим способом Forth:
</p>

<div class="org-src-container">
<pre class="src src-forth">: name ... exit ;
</pre>
</div>

<p>
Конец определения не делает неявный возврат (в отличие от Forth), поэтому вам нужно
вернуться явно, написав EXIT.
</p>

<p>
Вы вызываете такое определение, вызывая его имя, т.е. традиционным для Forth
образом. Вы можете явно вызвать такое определение с помощью <code>jump:name</code>; это может быть
написано явно, в духе портатабельного ассемблера. Оптимизация неявных хвостовых вызовов
не является сложной задачей, поэтому компилятор PAF тоже может это сделать.
</p>

<p>
Мы можем взять адрес определения с помощью <code>`name:tag</code> и вызывать его с <code>exec.tag</code> с
оптимизацией хвостового вызова как <code>jump.tag</code>. Тэг указывает, какие вызовы могут
вызывать определение.
</p>

<p>
Эффекты стека всех определений, адреса которых взяты с тем же тегом, должны быть
совместимы. То есть, должен быть один эффект стека, который описывает все из них,
например: <code>( x x -- x )</code> - это валидный эффект стека и для <code>+</code> и для <code>DROP</code>, (хотя
минимальный эффект стека для DROP это <code>( x -- )</code> так что <code>+</code> и <code>DROP</code> имеют совместимые
стековые эффекты).
</p>

<p>
Использование тегов здесь имеет две цели:
</p>
<ul class="org-ul">
<li>информирует компилятор PAF о потоке управления;</li>
<li>сообщает об эффекте стека косвенного вызова (в то время как компилятор обычного Forth
предполагает, что EXECUTE может вызвать что угодно и иметь какой-угодно эффект
стека). Или, наоборот, в связи с правилом глубины стека: теги допускают различные
эффекты стека для косвенно вызываемых определений с разными тегами; без тегов, все
косвенно вызываемые определения должны иметь одинаковый эффект стека.</li>
</ul>
</div>
</div>

<div id="outline-container-org26026b3" class="outline-3">
<h3 id="org26026b3">ABI определения и ABI вызовы</h3>
<div class="outline-text-3" id="text-org26026b3">
<p>
Нам нужно явно указать эффект стека как сигнатуру определения или вызова
ABI. Синтаксисом такой сигнатуры является <code>[xr]*-[xr]*</code>, где <code>x</code> указывает аргумент
ячейки (машинное слово/integer/адрес), а <code>r</code> - аргумент с плавающей запятой; буквы до
тире указывают параметры, а буквы после тире - результаты. Разделение на <code>x</code> и <code>r</code>
отражает деление на регистры общего назначения и регистры с плавающей запятой на
реальных машинах и роль, которую эти регистры играют во многих соглашениях о вызовах.
</p>

<p>
Определение, соответствующее вызывающему соглашению определяется с помощью <code>abi:sig
name</code>. Sig указывает эффект стека и указывает соответствие между параметрами ABI и
элементами стека PAF. Эта сигнатура не является достаточно избыточной, например,
рассмотрим разницу между следующими определениями:
</p>

<div class="org-src-container">
<pre class="src src-forth">abi:x-x  id   exit ;
</pre>
</div>

<p>
и
</p>

<div class="org-src-container">
<pre class="src src-forth">abi:-    noop exit ;
</pre>
</div>

<p>
Эти определения различаются только сигнатурой, но они ведут себя по-разному: id
возвращает свой аргумент, noop нет, и в соглашениях об ABI-вызовах обычно существует
разница между этими поведениями.
</p>

<p>
Вы можете вызвать ABI-совместимую функцию с помощью <code>abi.name.sig</code>, где <code>name</code> - это
имя функции (которая может быть определением PAF или функцией, написанной на другом
языке и динамически или статически связанной с программой PAF). Подпись определяет,
сколько и какие типы элементов стека передаются вызываемым функциям, и какой тип
возвращаемого значения (если есть), чтобы push-ить его на стек.
</p>

<p>
Включение подписи в каждый вызове может быть немного утомительным повторением для
программистов-людей, но PAF в основном предназначен как промежуточный язык, и
преимущество этой схемы заключается в том, что разные вызовы одной и той же функции
(например, printf) могут иметь разные эффекты стека.
</p>

<p>
Вы можете взять адрес ABI функции с именем <code>abi`name</code> и вызвать его с помощью
<code>abi-exec.sig</code>. Нет никаких хвостовых вызовов для функций ABI, потому что мы не можем
гарантировать, что хвостовые вызовы могут быть оптимизированы во всех соглашениях о
вызовах.
</p>

<p>
В отличие от определений PAF, для функций ABI нет смысла отмечать эти адреса функций,
поскольку вызов всегда использует соглашение о вызове ABI (тогда как компилятор может
определить вызывающий интерфейс для вызовов PAF). Подпись в косвенных вызовах ABI имеет
такое же значение, как и в прямых вызовах ABI.
</p>
</div>
</div>

<div id="outline-container-orgad54ec8" class="outline-3">
<h3 id="orgad54ec8">Обсуждение определений и вызовов</h3>
<div class="outline-text-3" id="text-orgad54ec8">
<p>
Почему существуют два типа определений и два вида вызовов?  Определения и вызовы PAF
позволяют реализовать различные структуры управления, такие как backtrackng через
хвостовые вызовы [Ste77]. Они также позволяют компилятору использовать гибкие и,
возможно, более эффективные интерфейсы вызовов, чем соглашение о вызове ABI.
</p>

<p>
С другой стороны, ABI позволяют взаимодействовать с другими языками и использовать
динамически или статически связанные двоичные библиотеки, включая callback-и, и
использовать PAF для создания таких библиотек (например, в качестве плагинов).
</p>
</div>
</div>
