www/doc/paf.html

<div id="outline-container-org1edf571" class="outline-3">
<h3 id="org1edf571">Исключения</h3>
<div class="outline-text-3" id="text-org1edf571">
<p>
Возможно создание нелокального потока управления, такого как исключения с хвостовыми
вызовами, но часто более удобно разрешать определение PAF для функций/методов/процедур
исходного языка (нет необходимости распространять локальные переменные через несколько
определений) , Исключения представляют собой общую нелокальную конструкцию потока
управления, поэтому PAF включает их.
</p>
</div>
</div>
</div>

<div id="outline-container-org7332b2c" class="outline-2">
<h2 id="org7332b2c">Отсутствующие возможности</h2>
<div class="outline-text-2" id="text-org7332b2c">
<p>
В этом разделе рассматриваются различные функции, которые PAF не имеет и причины их
отсутствия.
</p>
</div>

<div id="outline-container-org12501bc" class="outline-3">
<h3 id="org12501bc">Сборка мусора</h3>
<div class="outline-text-3" id="text-org12501bc">
<p>
Ряд виртуальных машин, например Java VM, поддерживают сборку мусора. Однако эта функция
значительно ограничивает то, что можно сделать. В частности, представления данных
ограничены, и невозможно реализовать "неуправляемые" (unmanaged) языки или использовать
другое представление данных для языка сборки мусора (например, представление Java VM
значительно отличается от того, как большинство систем Prolog или Lisp представляют
свои данные).
</p>

<p>
Даже C&#x2013;, назначение которого - быть переносимым языком ассемблера для имеющих сборку
мусора языков, не реализует сборку мусора, а оставляет ее для реализации на языке более
высокого уровня, поскольку это оставляет полную свободу в том, как внедрять данные и
сборку мусора в язык более высокого уровня [JRR99].
</p>
</div>
</div>

<div id="outline-container-org58f170d" class="outline-3">
<h3 id="org58f170d">Типы</h3>
<div class="outline-text-3" id="text-org58f170d">
<p>
PAF не выполняет проверку типов во время компиляции или во время выполнения. Кроме
того, нет перегрузки нескольких операций с одним и тем же оператором на основе
типов. Это согласуется с нисходящим подходом из Forth, и не-переносимые ассемблеры
имеют тот же подход.
</p>

<p>
Напротив, в C&#x2013; компилятор знает о типах данных и использует эти знания для разрешения
неоднозначностей при перегрузке операций. Недостатком таких подходов является то, что
он усложняет компилятор C&#x2013; компилятора, не облегчая жизнь для компилятора фронтенда,
который должен точно знать, хочет ли он выполнять, скажем, знаковое или беззнаковое
сравнение.
</p>

<p>
Можно задаться вопросом о "отсутствии" некоторых операций в PAF; например, таких как
<code>&lt;?</code> <code>U&lt;?</code> , но только <code>=?</code> <code>+</code> <code>-</code> <code>*</code>. Причина в том, что на целевых для PAF машинах,
эти операции являются идентичными для знаковых и беззнаковых чисел.
</p>
</div>
</div>

<div id="outline-container-org0371718" class="outline-3">
<h3 id="org0371718">Отладчик</h3>
<div class="outline-text-3" id="text-org0371718">
<p>
Довольно много усилий в C&#x2013; посвящено поддержке стандартного отладчика. Пока нет планов
предпринять такие усилия для PAF. Cи стал успешным переносным языком ассемблера, хотя у
него очень мало поддержки отладчика для языков, которые используют его как
промежуточный язык.
</p>
</div>
</div>

<div id="outline-container-org4033dcf" class="outline-3">
<h3 id="org4033dcf">SIMD</h3>
<div class="outline-text-3" id="text-org4033dcf">
<p>
Поддержка наборов инструкций SIMD, таких как SSE, AVX, AltiVec и.т.д., не планируется,
главным образом потому, что даже некоторые языки более высокого уровня нуждаются в
таких функциях. Они могут быть добавлены позже, если возникнет необходимость.
</p>
</div>
</div>
</div>

<div id="outline-container-org87599c4" class="outline-2">
<h2 id="org87599c4">PAF vs Forth</h2>
<div class="outline-text-2" id="text-org87599c4">
<p>
Ограничения на обработку стека в PAF дают новое представление о Forth, и мы более
подробно рассмотрим это в этом разделе.
</p>
</div>

<div id="outline-container-orga7f887a" class="outline-3">
<h3 id="orga7f887a">Влияние на реализацию</h3>
<div class="outline-text-3" id="text-orga7f887a">
<p>
PAF имеет ограничения и функции, которые позволяют компилятору статически определять
глубину стека. Как следствие, в PAF нет необходимости реализовывать стеки в памяти с
указателем стека для каждого стека (стек данных и стек возвратов для ячеек, стек с
плавающей точкой для значений с плавающей точкой)
</p>

<p>
В отличии от PAF, Forth должен иметь отдельную область памяти и указатель стека для
каждого стека, и пока элементы стека могут храниться в регистре для большей части кода,
есть несколько слов (в частности, EXECUTE) и шаблонов кода (несбалансированные эффекты
стека на соединении потоков управления), которые заставляют перемещать элементы стека в
память и обычно также вызывают обновление указателя стека.
</p>

<p>
Это свойство Forth исключается из PAF, требуя сбалансированных эффектов стека на
объединении потоков управления (см.<a href="#org3bb1ad6">поток управления внутри определений</a>) и заменяя
EXECUTE на <code>exec.tag</code> (см. <a href="#org688c7c8">PAF определения и PAF вызовы</a>); все адреса определения,
возвращенные для определенного тега, необходимы для совместимых эффектов стека, поэтому
<code>exec.tag</code> имеет статически определенный эффект стека.
</p>
</div>
</div>

<div id="outline-container-orgfa36f3d" class="outline-3">
<h3 id="orgfa36f3d">Влияние на программы</h3>
<div class="outline-text-3" id="text-orgfa36f3d">
<p>
Влияние на реальные программ относительно невелико: в большинстве случаев у кода Forth
есть сбалансированные эффекты стека для потока управления, и большинство случаев <code>`</code> и
EXECUTE могут быть преобразованы в их тегированные варианты, поскольку программисты
сохраняют глубину стека статически определяемой, чтобы сохранить код понятным.
</p>

<p>
Однако есть случаи, когда ограничения не так просто соблюдать. Например,
объектно-ориентированные пакеты в Forth используют EXECUTE для слов с произвольными
эффектами стека. Программы, использующие эти слова, также имеют статический эффект
стека, но он присутствует только на более высоком уровне; например, если для каждого
селектора методов используется отдельный тег (и отдельный exec.tag), типичное
использование соответствует ограничению, но в большинстве объектно-ориентированных
пакетов выполняется только одно EXECUTE.
</p>

<p>
Ниже показан код для этого примера: вариант Forth определяет определяющий
селектор слов, а затем селекторы определяются этим определяющим словом; напротив,
вариант PAF определяет селекторов напрямую (и имеет довольно много повторов), каждый со
своим тегом.
</p>

<div class="org-src-container">
<pre class="src src-forth">\ Forth
: selector ( offset -- )
    create ,
  does&gt; ( ... o -- ... )
    @ over @ + @ execute ;

1 cells selector foo
2 cells selector bar

\ PAF
: foo ( ... o -- ... )
    dup @ 1 cells + @ jump.foo ;
: bar ( ... o -- ... )
    dup @ 2 cells + @ jump.bar ;
</pre>
</div>

<p>
Если вы хотите определить определяющее слово для селекторов методов, как вы обычно
делаете в Forth, тег должен быть передан как параметр времени определения между
участвующими определяющими словами. Эта поддержка программирования на более высоком
уровне не требуется внутри PAF (там мы оставляем такое метапрограммирование на язык
более высокого уровня), но если мы хотим передать идею тега обратно в Forth, нам
придется добавить такие вещи.
</p>
</div>
</div>
