org/doc/paf.org
** Компиляция Forth в PAF

Перевод Forth-кода, который не является кодом PAF в код PAF, может быть поучительным.
В качестве примера мы используем другой вариант кода, приведенного выше.

Этот вариант определяет селектор как определение двоеточия, а не с помощью ~does>~; для
целей презентации мы оставляем определяющий селектор слов и определяем селектор foo
напрямую, а не с помощью селектора foo:

#+BEGIN_SRC forth
  : do-selector ( .. obj m-off -- .. )
      over @ + @ execute ;

  : foo ( .. obj -- .. )
      1 cells do-method ;

  : bar ( -- )
      1 2 my-obj foo . ;
#+END_SRC

Это не PAF из-за EXECUTE, который может иметь произвольный эффект стека. Мы переводим
этот кадр в PAF jump с тегом; мы решили что соглашение о вызове PAF для xts с этим
тегом (--). То есть, любые эффекты Forth-стека должны быть переведены на обращения к
явно реализованному стеку в памяти PAF. Указатель стека стека данных реализуется как
значение sp.

Сам Do-selector должен хранить объект obj стека в этом явном стеке, но прямой и
косвенный вызывающие вызовы do-selector обычно также должны получить доступ к этому
явному стеклу. В нашем примере бар должен сделать push двух элементов в явном стеке и
вытащить один элемент из явного стека:

#+BEGIN_SRC forth
  0 value sp

  : do-method
      over sp cell- tuck ! to sp
      swap @ + @ jump.forth ;

  : foo
      1 cells jump:do-method ;

  : bar
      sp cell- 1 over !
      cell- 2 over !
      to sp
      my-obj foo
      sp dup @ swap cell+ to sp
      jump:. ;
#+END_SRC

Аналогично нужно было бы реализовать стек с плавающей точкой. Некоторые люди хотели бы
расширить стандарт Forth с помощью манипуляций с адресами возврата. Можно также сделать
перевод с такого расширенного Forth на PAF, и он показывает, насколько дорога эта
функция. Глядя на часть do-метода примера выше:

#+BEGIN_SRC forth
  0 value sp

  0 value rp

  : thunk1
      exit ;

  : do-method
      over sp cell- tuck ! to sp
      swap @ + @
      rp cell- to rp ’thunk1:forth rp !
      exec.forth rp cell+ to rp
      jump:thunk1 ;
#+END_SRC

Указатель стека возврата должен быть явным (как rp). Вместо того, чтобы переводить
выполнение в косвенный хвостовой вызов (jump.forth), мы должны сначала сохранить
обратный адрес ~`thunk1:forth~ в явном стеке возврата, а затем использовать косвенный
не-хвостовой вызов ~exec.forth~, а затем drop-нуть возврат адрес возврата из явного
стека возвратов, а затем продолжить с остальной частью определения (thunk1), который
просто возвращается в этом случае.

* Связанные работы

Мы обсудили C, LLVM, C-- и Vcode/GNU Lightning в разделе [[*Предыдущие работы][предыдущие работы]].

Существуют проекты, похожие на PAF в использовании ограниченной или модифицированной
формы языка более высокого уровня в качестве переносимого ассемблера:
- Python-система PyPy использует ограниченную форму Python, называемую RPython, как
  промежуточный язык низкого уровня [AACM07].
- asm.js является подмножеством JavaScript, который настолько ограничен, что он может
  служить переносимым языком ассемблера.
- PreScheme является низкоуровневым подмножеством Scheme, используемым в качестве
  промежуточного языка для реализации Scheme48 [KR94].

Во всех этих случаях базовый язык намного более высокоуровневый, чем у Forth, и гораздо
более растягивается создание низкоуровневого подмножества, чем для Forth.

Machine Forth (который превратился в colorForth) - это простой вариант Forth, созданный
Чарльзом Муром, изобретателем Forth. Он тесно соответствует инструкциям его
Forth-процессоров, но он также написал реализацию для IA-32, которая создает
собственный код. Компилятор IA-32 очень прост, в основном просто расширяя слова до
коротких машинных кодовых последовательностей.

Он не отображает элементы стека за верхний стек для регистров, но сгенерированный код
относительно компактен; это отражает тот факт, что Machine Forth находится близко к
машине, включая IA-32.

* Вывод

PAF - это подмножество / диалект Forth, который предназначен как переносной язык
ассемблера. Основным вкладом PAF являются:

- *Теги*, указывающие, какие косвенные ветвления могут достигать каких меток и какие
  косвенные вызовы могут вызывать какие определения. По сравнению с общими непрямыми
  ветвями и вызовами, это дает больше свободы для использования стека фронтенда и для
  аллокации регистров компилятора PAF. Метки нуждаются в меньшем объеме усилий по
  внедрению и дают лучшие результаты, чем попытки добиться того же результата
  посредством анализа программ.
- *Определения и вызовы* разделяющиеся на те, которые соответствуют соглашению
  ABI/соглашению о вызовах платформы, и другие, для которых компилятор может
  использовать любой вызывающий интерфейс (разные для разных наборов вызывающих и
  вызываемых процедур). Это позволяет оптимизировать хвостовые вызовы (в отличие от
  соглашений о вызове ABI), что, в свою очередь, означает, что мы можем использовать
  вызовы как примитив для произвольных структур управления (например, для сопрограмм).
- *Ограничения* (по сравнению с Forth) на использование элементов стека позволяют иметь
  статическую связь между элементами стека и регистрами для всех программ и избегать
  необходимости отдельного указателя стека и области памяти для каждого стека. Это
  подчеркивает, какие возможности Forth дороги и где они используются.

* Ссылки

[AACM07] Davide Ancona, Massimo Ancona, Antonio Cuni, and Nicholas D. Matsakis.
RPython: a step towards reconciling dynamically and statically typed OO languages.  In
Pascal Costanza and Robert Hirschfeld, editors, DLS, pages 53–64. ACM, 2007.

[Bad90] Wil Baden.  Virtual rheology.  In FORML’90 Proceedings, 1990.

[Eng96] Dawson R. Engler. vcode: A retargetable, extensible, very fast dynamic code
generation system. In SIG-PLAN ’96 Conference on Programming Language Design and
Implementation, pages 160–170, 1996.

[JRR99] Simon L. Peyton Jones, Norman Ramsey, and Fermin Reig.  C--: a portable
assembly language that supports garbage collection.  In International Conference on
Principles and Practice of Declarative Programming, September 1999.

[KR94] Richard A. Kelsey and Jonathan A. Rees. A tractable Scheme implementation. Lisp
and Symbolic Computation, 7(4):315–335, 1994.

[LA04] Chris Lattner and Vikram S. Adve. LLVM: A compilation framework for lifelong
program analysis & transformation. In Code Generation and Optimization (CGO), pages
75–88. IEEE Computer Society, 2004.

[Ste77] Guy Lewis Steele Jr.  Debunking the “expensive procedure call” myth or
procedure call implementations considered harmful or lambda: The ultimate goto. AI Memo
443, MIT AI Lab, October 1977

Orig: http://www.complang.tuwien.ac.at/anton/euroforth/ef13/papers/ertl-paf.pdf
